import React from 'react';
import "./App.css";
const AboutUsPage = () => {
    return (
        <div>
            <h1>О нас</h1>
            <p>Мы команда энтузиастов, создающих волшебные сказки! Наша цель – делиться удивительными историями, которые вдохновляют и учат. Мы верим, что сказки могут быть источником радости и мудрости для людей любого возраста.</p>

            <h2>Наша миссия</h2>
            <p>Наша миссия заключается в том, чтобы оживлять классические и современные сказки, делая их доступными и интересными для широкой аудитории. Мы стремимся создавать контент высокого качества, который будет радовать наших читателей и слушателей.</p>

            <h2>Кто мы?</h2>
            <p>Наш коллектив состоит из талантливых писателей, иллюстраторов, дизайнеров и разработчиков. Каждый член команды привносит свой уникальный вклад, создавая магические миры, полные приключений и чудес.</p>

            <h2>Как мы работаем?</h2>
            <p>Процесс создания сказок начинается с идеи, которую обсуждает вся команда. Затем писатели разрабатывают сюжет, иллюстраторы создают визуальные образы, а дизайнеры и разработчики воплощают всё это в жизнь на нашем сайте. Мы постоянно улучшаем наши процессы, чтобы предоставлять нашим пользователям лучший опыт.</p>

            <h2>Присоединяйтесь к нам!</h2>
            <p>Если вы любите сказки так же сильно, как и мы, присоединяйтесь к нашему сообществу! Вы можете подписаться на нашу рассылку, следить за обновлениями в социальных сетях или даже стать частью нашей команды. Вместе мы можем сделать этот мир чуть-чуть волшебнее.</p>


        </div>
    );
};

export default AboutUsPage;