import React from 'react';
import "./App.css";
const ContactPage = () => {
    return (
        <div>
            <h1>Контакты</h1>
            <p>Мы всегда рады услышать от вас! Свяжитесь с нами любым удобным способом:</p>

            <h2>Электронная почта</h2>
            <p>Напишите нам письмо по адресу <a href="аъъъъ@jej.boombox">аъъъъ@jej.boombox</a>. Мы ответим вам.(наверное))</p>




            <h2>Адрес офиса</h2>
            <p>Вы также можете посетить наш офис лично: </p>
            <address>
                Улица Пушкина, дом колотушкина, квартира арбуз дыня не кавказ, чипи чипи яхехехй)<br />
                Телефон: красивый с кнопочками
            </address>


        </div>
    );
};

export default ContactPage;